In [16]:
# Scaling -- to scale down the values for better performance of ML algos
   # Two types of Scaling --> 1. Standard Scaling, 2. MinMax Scaler

In [17]:
# Scaling is a permanent process in ML

In [18]:
# 1. Standard Scaling (formula) ==> [x-u(mean)/sigma]
# 2. MinMax Scaler (formula) ==> [x-x(min)/x(max)-x(min)]

In [19]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import plotly.express as px
import warnings

warnings.filterwarnings("ignore")

In [20]:
df = pd.read_csv("Social_Network_Ads.csv")
df.head(3)

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0

In [21]:
df1 = df[['Age', 'EstimatedSalary']]
df1.head(3)

   Age  EstimatedSalary
0   19            19000
1   35            20000
2   26            43000

In [22]:
df1.describe()

              Age  EstimatedSalary
count  400.000000       400.000000
mean    37.655000     69742.500000
std     10.482877     34096.960282
min     18.000000     15000.000000
25%     29.750000     43000.000000
50%     37.000000     70000.000000
75%     46.000000     88000.000000
max     60.000000    150000.000000

In [23]:
# we can see in df1.describe(), there are lots of up and downs in values, so we can say that here to level-up use scaling.

In [24]:
# Using Scaling

In [25]:
# Standard Scaling --> In it, mean = 0, std = 1.
from sklearn.preprocessing import StandardScaler

In [26]:
sc = StandardScaler()

In [27]:
df2_sc = sc.fit_transform(df1)

In [28]:
df3 = pd.DataFrame(df2_sc, columns = ['Age', 'EstimatedSalary'])

In [29]:
df3.head(3)

        Age  EstimatedSalary
0 -1.781797        -1.490046
1 -0.253587        -1.460681
2 -1.113206        -0.785290

In [30]:
df3.describe()

                Age  EstimatedSalary
count  4.000000e+02     4.000000e+02
mean  -7.105427e-17    -1.776357e-17
std    1.001252e+00     1.001252e+00
min   -1.877311e+00    -1.607506e+00
25%   -7.550313e-01    -7.852897e-01
50%   -6.256110e-02     7.561451e-03
75%    7.970571e-01     5.361289e-01
max    2.134241e+00     2.356750e+00

In [31]:
np.round(df3.describe(), 2)

          Age  EstimatedSalary
count  400.00           400.00
mean    -0.00            -0.00
std      1.00             1.00
min     -1.88            -1.61
25%     -0.76            -0.79
50%     -0.06             0.01
75%      0.80             0.54
max      2.13             2.36

In [32]:
# Scaling has completed for above dataset.

In [33]:
###############################################################################################################

In [34]:
# Now working on other dataset

In [35]:
ds = pd.read_csv("salary_data.csv")
ds.head(3)

   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731

In [36]:
ds.isnull().sum()

YearsExperience    0
Salary             0
dtype: int64

In [37]:
ds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   YearsExperience  30 non-null     float64
 1   Salary           30 non-null     int64
dtypes: float64(1), int64(1)
memory usage: 612.0 bytes

In [38]:
ds.shape

(30, 2)

In [39]:
ds.describe()

       YearsExperience         Salary
count        30.000000      30.000000
mean          5.313333   76003.000000
std           2.837888   27414.429785
min           1.100000   37731.000000
25%           3.200000   56720.750000
50%           4.700000   65237.000000
75%           7.700000  100544.750000
max          10.500000  122391.000000

In [41]:
ds.columns

Index(['YearsExperience', 'Salary'], dtype='object')

In [42]:
ds1 = ds[['YearsExperience', 'Salary']]

In [43]:
ds1.head(3)

   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731

In [44]:
ds1.describe()

       YearsExperience         Salary
count        30.000000      30.000000
mean          5.313333   76003.000000
std           2.837888   27414.429785
min           1.100000   37731.000000
25%           3.200000   56720.750000
50%           4.700000   65237.000000
75%           7.700000  100544.750000
max          10.500000  122391.000000

In [45]:
# Using Scaling
from sklearn.preprocessing import StandardScaler

In [46]:
sc = StandardScaler()

In [47]:
ds2_sc = sc.fit_transform(ds1)

In [48]:
ds3 = pd.DataFrame(ds2_sc, columns = ['YearsExperience', 'Salary'])

In [49]:
ds3.head(3)

   YearsExperience    Salary
0        -1.510053 -1.360113
1        -1.438373 -1.105527
2        -1.366693 -1.419919

In [50]:
ds3.describe()

       YearsExperience        Salary
count     3.000000e+01  3.000000e+01
mean     -7.401487e-18  1.480297e-17
std       1.017095e+00  1.017095e+00
min      -1.510053e+00 -1.419919e+00
25%      -7.574158e-01 -7.153855e-01
50%      -2.198178e-01 -3.994264e-01
75%       8.553781e-01  9.105167e-01
max       1.858894e+00  1.721028e+00

In [52]:
np.round(ds3.describe(),2)

       YearsExperience  Salary
count            30.00   30.00
mean             -0.00    0.00
std               1.02    1.02
min              -1.51   -1.42
25%              -0.76   -0.72
50%              -0.22   -0.40
75%               0.86    0.91
max               1.86    1.72

In [53]:
# Scaling is Completed on this dataset

In [54]:
###############################################################################################################

In [55]:
# Working on other dataset